ubinos/nrf5sdk_wrapper/app/myble_app_att_mtu_throughput/myble_app_att_mtu_throughput.c
    switch (m_gap_role)
    {
        default:
            // If no connection was established, the role is not established either.
            // In this case, start both the advertising and the scanning.
            advertising_start();
            scan_start();
            break;

        case BLE_GAP_ROLE_PERIPH:
            advertising_start();
            m_test_params.phys.tx_phys = BLE_GAP_PHY_2MBPS;
            break;

        case BLE_GAP_ROLE_CENTRAL:
            scan_start();
            break;
    }
}


static void test_run(void)
{
	m_test_start_tick = ubik_gettickcount();
    nrf_ble_amts_notif_spam(&m_amts);
}


static bool is_test_ready()
{
    return (   (m_board_role == BOARD_TESTER)
            && m_conn_interval_configured
            && m_notif_enabled
            && m_mtu_exchanged
            && (m_data_length_updated || m_test_params.data_len == DATA_LENGTH_DEFAULT)
            && m_phy_updated
            && !m_run_test);
}


void cli_process(void)
{
#if CLI_OVER_UART
    nrf_cli_process(&m_cli_uart);
#endif

#if CLI_OVER_DTTY
    nrf_cli_process(&m_cli_dtty);
#endif
}


int idletaskhookfunc(void * arg) {
	for (;;) {
	    cli_process();

	    if (is_test_ready())
	    {
	        NRF_LOG_INFO("Test started");
	        m_run_test = true;
	        test_run();
	    }

	    if (NRF_LOG_PROCESS() == false)
	    {
	    	break;
	    }
	}

	return 0;
}


static void test_terminate(void)
{
    m_run_test                 = false;
    m_notif_enabled            = false;
    m_mtu_exchanged            = false;
    m_data_length_updated      = false;
    m_phy_updated              = false;
    m_conn_interval_configured = false;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        NRF_LOG_INFO("Disconnecting...");

        ret_code_t err_code;
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("sd_ble_gap_disconnect() failed: 0x%0x.", err_code);
        }
    }
    else
    {
        if (m_board_role == BOARD_DUMMY)
        {
            if (m_gap_role == BLE_GAP_ROLE_PERIPH)
            {
                advertising_start();
            }
            else
            {
                scan_start();
            }
        }
    }
}


void cli_init(void)
{
#if CLI_OVER_RTT
    if (CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk)
    {
        ret_code_t err_code = nrf_cli_init(&m_cli_rtt, NULL, true, true, NRF_LOG_SEVERITY_INFO);
        APP_ERROR_CHECK(err_code);
    }
#endif

    ret_code_t err_code = NRF_SUCCESS;
    (void) err_code;

#if CLI_OVER_UART
    nrf_drv_uart_config_t uart_config = NRF_DRV_UART_DEFAULT_CONFIG;
    uart_config.pseltxd = TX_PIN_NUMBER;
    uart_config.pselrxd = RX_PIN_NUMBER;
    uart_config.hwfc    = NRF_UART_HWFC_DISABLED;

    err_code = nrf_cli_init(&m_cli_uart, &uart_config, true, true, NRF_LOG_SEVERITY_INFO);
    APP_ERROR_CHECK(err_code);
#endif

#if CLI_OVER_DTTY
    err_code = nrf_cli_init(&m_cli_dtty, NULL, true, true, NRF_LOG_SEVERITY_INFO);
    APP_ERROR_CHECK(err_code);
#endif
}


void cli_start(void)
{
    ret_code_t err_code = NRF_SUCCESS;
    (void) err_code;

#if CLI_OVER_UART
    err_code = nrf_cli_start(&m_cli_uart);
    APP_ERROR_CHECK(err_code);
#endif

#if CLI_OVER_DTTY
    err_code = nrf_cli_start(&m_cli_dtty);
    APP_ERROR_CHECK(err_code);
#endif
}


static void taskfunc(void *arg);
static void task1func(void *arg);
static void task2func(void *arg);


int appmain(int argc, char *argv[]) {
	int r;

	__enable_irq();
	ARM_INTERRUPT_ENABLE();

    // Initialize.
    log_init();
    cli_init();
    leds_init();
    timer_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_data_set();
    scan_init();

	ARM_INTERRUPT_DISABLE();
    __disable_irq();

    srand(time(NULL));

	r = task_create(NULL, taskfunc, NULL, task_getmiddlepriority(), 0, "task0");
	if (0 != r) {
		logme("fail at task_create\r\n");
	}

	ubik_comp_start();

	return 0;
}

static void taskfunc(void *arg) {
	int r;

    server_init();
    client_init();

    gatt_mtu_set(m_test_params.att_mtu);
    conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);

    // Start execution.
    cli_start();
    buttons_enable();

    NRF_LOG_INFO("My ATT MTU example 2 started.");
    NRF_LOG_INFO("Press button 3 on the board connected to the PC.");
    NRF_LOG_INFO("Press button 4 on other board.");

	r = task_create(NULL, task1func, NULL, task_getmiddlepriority(), 0, "task1");
	if (0 != r) {
		logme("fail at task_create\r\n");
	}

	r = task_create(NULL, task2func, NULL, task_getmiddlepriority(), 0, "task2");
	if (0 != r) {
		logme("fail at task_create\r\n");
	}

	r = ubik_setidletaskhookfunc(&idletaskhookfunc, 0, "idle_state_handle", IDLEHOOKFUNC_OPT__REPEAT);
	assert(r == 0);
}

static void task1func(void *arg) {
	unsigned int delayms;

	task_sleepms(1000);

	for (unsigned int i = 0;; i++) {
		delayms = (rand() % 10 + 1) * 500;
		printf("1: hello world ! (%u) (delay = %4d ms)\r\n", i, delayms);
		task_sleepms(delayms);
	}
}

static void task2func(void *arg) {
	unsigned int delayms;

	task_sleepms(1000);

	for (unsigned int i = 0;; i++) {
		delayms = (rand() % 10 + 1) * 500;
		printf("2: hello world ! (%u) (delay = %4d ms)\r\n", i, delayms);
		task_sleepms(delayms);
	}
}

#endif /* (INCLUDE__APP__myble_app_att_mtu_throughput == 1) */

